{
    "actions": {
        "Crush.": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d6 + 3) bludgeoning damage, and the\ndarkmantle attaches to the target. If the target is Medium or smaller and the darkmantle has advantage on the attack roll, it attaches by engulfing\nthe target's head, and the target is also blinded and unable to breathe while the darkmantle is attached in this way.  \nWhile attached to the target, the darkmantle can attack no other creature except the target but has advantage on its attack rolls. The darkmantle's\nspeed also becomes 0, it can't benefit from any bonus to its speed, and it moves with the target.  \nA creature can detach the darkmantle by making a successful DC 13 Strength check as an action. On its turn, the darkmantle can detach itself from the\ntarget by using 5 feet of movement.",
        "Darkness Aura (1/Day).": "A 15-­‐foot radius of magical darkness extends out from the darkmantle, moves with it, and spreads around\ncorners. The darkness lasts as long as the darkmantle maintains concentration, up to 10 minutes (as if concentrating on a spell). Darkvision can't\npenetrate this darkness, and no natural light can illuminate it. If any of the darkness overlaps with an area of light created by a spell of 2nd level\nor lower, the spell creating the light is dispelled."
    },
    "armor_class": 11,
    "challenge_rating": 0.5,
    "charisma": {
        "modifier": 0,
        "score": 10
    },
    "constitution": {
        "modifier": 0,
        "score": 10
    },
    "description": "Small monstrosity, unaligned\n",
    "dexterity": {
        "modifier": 0,
        "score": 10
    },
    "features": {
        "Echolocation.": " The darkmantle can't use its blindsight while deafened.  ",
        "False Appearance.": " While the darkmantle remains motionless, it is indistinguishable from a cave formation such as a stalactite or\nstalagmite. "
    },
    "fly_speed": 30,
    "hit_dice": "5d6+5",
    "hp_max": 22,
    "intelligence": {
        "modifier": 0,
        "score": 10
    },
    "languages": " --  ",
    "name": "Darkmantle",
    "reactions": {},
    "saving_throws": "Dex +0",
    "senses": " blindsight 60 ft., passive Perception 10  ",
    "skills": " Stealth +3  ",
    "speed": 10,
    "strength": {
        "modifier": 0,
        "score": 10
    },
    "swim_speed": 0,
    "wisdom": {
        "modifier": 0,
        "score": 10
    }
}