{
    "actions": {
        "Multiattack.": "The doppelganger makes two melee attacks.",
        "Read Thoughts.": "The doppelganger magically reads the surface thoughts of one creature within 60 feet of it. The effect can penetrate\nbarriers, but 3 feet of wood or dirt, 2 feet of stone, 2 inches of metal, or a thin sheet of lead blocks it. While the target is in range, the\ndoppelganger can continue reading its thoughts, as long as the doppelganger's concentration isn't broken (as if concentrating on a spell). While\nreading the target's mind, the doppelganger has advantage on Wisdom (Insight) and Charisma (Deception, Intimidation, and Persuasion) checks against\nthe target.",
        "Slam.": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage."
    },
    "armor_class": 14,
    "challenge_rating": 3.0,
    "charisma": {
        "modifier": 0,
        "score": 10
    },
    "constitution": {
        "modifier": 0,
        "score": 10
    },
    "description": "Medium monstrosity (shapechanger), neutral\n",
    "dexterity": {
        "modifier": 0,
        "score": 10
    },
    "features": {
        "Ambusher.": " The doppelganger has advantage on attack rolls against any creature it has surprised. Surprise Attack. If the doppelganger\nsurprises a creature and hits it with an attack during the first round of combat, the target takes an extra 10 (3d6) damage from the attack. ",
        "Shapechanger.": " The doppelganger can use its action to polymorph into a Small or Medium humanoid it has seen, or back into its true\nform. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its\ntrue form if it dies.  "
    },
    "fly_speed": 0,
    "hit_dice": "8d8+16",
    "hp_max": 52,
    "intelligence": {
        "modifier": 0,
        "score": 10
    },
    "languages": " Common  ",
    "name": "Doppelganger",
    "reactions": {},
    "saving_throws": "Dex +0",
    "senses": " darkvision 60 ft., passive Perception 11  ",
    "skills": " Deception +6, Insight +3  ",
    "speed": 30,
    "strength": {
        "modifier": 0,
        "score": 10
    },
    "swim_speed": 0,
    "wisdom": {
        "modifier": 0,
        "score": 10
    }
}