{
    "actions": {
        "Bite.": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) piercing damage. If the target is\na creature, it must succeed on a DC 15 Constitution saving throw against disease or become poisoned until the disease is cured. Every 24 hours that\nelapse, the target must repeat the saving throw, reducing its hit point maximum by 5 (1d10) on a failure. The disease is cured on a success. The\ntarget dies if the disease reduces its hit point maximum to 0. This reduction to the target's hit point maximum lasts until the disease is cured.",
        "Multiattack.": "The otyugh makes three attacks: one with its bite and two with its tentacles.",
        "Tentacle Slam.": "The otyugh slams creatures grappled by it into each other or a solid surface. Each creature must succeed on a DC 14\nConstitution saving throw or take 10 (2d6 + 3) bludgeoning damage and be stunned until the end of the otyugh's next turn. On a successful save, the\ntarget takes half the bludgeoning damage and isn't stunned.",
        "Tentacle.": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage plus 4\n(1d8) piercing damage. If the target is Medium or smaller, it is grappled (escape DC 13) and restrained until the grapple ends. The otyugh has two\ntentacles, each of which can grapple one target."
    },
    "armor_class": 14,
    "challenge_rating": 5.0,
    "charisma": {
        "modifier": 0,
        "score": 10
    },
    "constitution": {
        "modifier": 0,
        "score": 10
    },
    "description": "Large aberration, neutral\n",
    "dexterity": {
        "modifier": 0,
        "score": 10
    },
    "features": {
        "Limited Telepathy.": " The otyugh can magically transmit simple messages and images to any creature within 120 feet of it that can\nunderstand a language. This form of telepathy doesn't allow the receiving creature to telepathically respond. "
    },
    "fly_speed": 0,
    "hit_dice": "12d10+48",
    "hp_max": 114,
    "intelligence": {
        "modifier": 0,
        "score": 10
    },
    "languages": " Otyugh  ",
    "name": "Otyugh",
    "reactions": {},
    "saving_throws": "Con +7  ",
    "senses": " darkvision 120 ft., passive Perception 11  ",
    "skills": "Perception +3, Stealth +4",
    "speed": 30,
    "strength": {
        "modifier": 0,
        "score": 10
    },
    "swim_speed": 0,
    "wisdom": {
        "modifier": 0,
        "score": 10
    }
}